In [1]:
import pandas as pd

In [2]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [3]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [4]:
# Export data
car_sales.to_csv("exported-car-sales.csv")

## Describe Data

In [5]:
#Attribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [6]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [7]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [8]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [9]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

## Viewing and selecting data

In [10]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [11]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [12]:
# .loc & .iloc
animals = pd.Series(["cat","dog","bird","panda","snake"],
                   index=[0,3,9,8,3])

In [13]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [14]:
animals.loc[3]

3      dog
3    snake
dtype: object

In [15]:
animals.iloc[3]

'panda'

In [16]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [17]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [18]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [19]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [20]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [21]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [22]:
# Groupby
car_sales.groupby(["Make"]).mean()

C:\Users\tophe\AppData\Local\Temp\ipykernel_7488\698118765.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  car_sales.groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [23]:
car_sales["Odometer (KM)"].plott()

AttributeError: 'Series' object has no attribute 'plott'

In [ ]:
car_sales["Odometer (KM)"].hist()

In [ ]:
car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]','').astype(int)

In [ ]:
car_sales["Price"].plot()

In [ ]:
car_sales["Price"]  =car_sales["Price"]/100

## Manipulating Data

In [ ]:
car_sales["Make"].str.lower()

In [ ]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")
car_sales_missing

In [24]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [28]:
car_sales_shuffled = car_sales.sample(frac=1)

In [40]:
car_sales_shuffled.reset_index(drop=True, inplace=True)

In [38]:
car_sales_shuffled.reset_index(inplace=True)

In [41]:
car_sales_shuffled

   index    Make Colour  Odometer (KM)  Doors       Price
0      3     BMW  Black          11179      5  $22,000.00
1      4  Nissan  White         213095      4   $3,500.00
2      0  Toyota  White         150043      4   $4,000.00
3      5  Toyota  Green          99213      4   $4,500.00
4      7   Honda   Blue          54738      4   $7,000.00
5      2  Toyota   Blue          32549      3   $7,000.00
6      1   Honda    Red          87899      4   $5,000.00
7      8  Toyota  White          60000      4   $6,250.00
8      9  Nissan  White          31600      4   $9,700.00
9      6   Honda   Blue          45698      4   $7,500.00

In [42]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x/1.6)

In [43]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
7   Honda   Blue      34211.250      4   $7,000.00
1   Honda    Red      54936.875      4   $5,000.00
5  Toyota  Green      62008.125      4   $4,500.00
4  Nissan  White     133184.375      4   $3,500.00
2  Toyota   Blue      20343.125      3   $7,000.00
0  Toyota  White      93776.875      4   $4,000.00
8  Toyota  White      37500.000      4   $6,250.00
9  Nissan  White      19750.000      4   $9,700.00
3     BMW  Black       6986.875      5  $22,000.00
6   Honda   Blue      28561.250      4   $7,500.00